Repository: releng-tool/releng-tool-doc-translations
Catalog: locale-development/*/LC_MESSAGES/install.po
Languages: pl

source: Installation
pl: Instalacja

source: The recommended method of installation is using pip_:
pl: releng-tool można zainstalować korzystając z pip_:

source: To verify the package has been installed the following command can be used:
pl: Następujące polecenie sprawdza, czy pakiet został zainstalowany:

source: Quick-start
pl: Szybki start

source: The following provides a series of steps to assist in preparing a new environment to use this package. This quick-start will aim to use the most recent version of Python.
pl: Poniżej przedstawiono szereg kroków mających na celu pomoc w przygotowaniu nowego środowiska do korzystania z tego pakietu. Quick-start będzie korzystać z najnowszej wersji Pythona.

source: Linux
pl: Linuxa

source: While the use of Python_/pip_ is almost consistent between Linux distributions, the following are a series of helpful steps to install this package under specific distributions of Linux. From a terminal, invoke the following commands:
pl: Chociaż korzystanie z Python_/pip_ jest praktycznie zgodne pomiędzy dystrybucjami Linuxa, poniżej przedstawiono serię kroków pomocniczych, aby zainstalować dany pakiet w określonych dystrybucjach Linuxa. Z terminala wywołaj następujące polecenia:

source: From a terminal, invoke the following commands:
pl: Z terminala wywołaj następujące polecenia:

source: If not already installed, download the most recent version of Python_:
pl: Należy upewnić się, że najnowsza wersja Pythona_ jest zainstalowana.

source: Python - Downloads
pl: Python - Pliki do pobrania

source: When invoking the installer, it is recommended to select the option to "Add Python to PATH"; however, users can explicitly invoked Python from an absolute path (the remainder of these steps will assume Python is available in the path).
pl: W momencie otarcia instalatora zaleca się wybrać opcję „Add Python to PATH”; jednakże użytkownicy mogą wybrać dowolną ścieżkę do otwarcia Pythona (w kolejnych krokach zakłada się, że Python jest dostępny w tej ścieżce).

source: Open a Windows command prompt and invoke the following:
pl: Otwórz wiersz poleceń Windowsa i wywołaj:

source: Development
pl: Oprogramowanie

source: To install the most recent development sources, the following pip_ command can be used:
pl: Aby zainstalować najnowsze źródła oprogramowania, można skorzystać z następującego polecenia pip_:
